/********************************************************************************
**
** 文件名:     dynamic_sms.h
** 版权所有:   
** 文件描述:   定时器
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**|  |  | 
*********************************************************************************/
#ifndef __DYNAMIC_SMS_H__
#define __DYNAMIC_SMS_H__ 1

#include "dynamic_init.h"

#define MAX_SMS_LEN 200
#define DYNAMIC_SMS_LIST_NUM 10

typedef struct _sms_data_
{
    kal_uint8 ph_num[MAX_PHONE_NUM_LEN];
    srv_sms_dcs_enum dcs; // 未生效
    kal_uint16 len;
    kal_uint8 data[MAX_SMS_LEN];
    
}DYNAMIC_SMS_DATA_T;

typedef struct __sms_list_
{
	kal_uint8 fail_cnt; // 当前发送失败次数
	kal_uint8 data_in; // 保存索引
	kal_uint8 data_out; // 取出发送索引
	DYNAMIC_SMS_DATA_T info[DYNAMIC_SMS_LIST_NUM];
	kal_uint32 checksum;
}DYNAMIC_SMS_LIST_T;


/*******************************************************************
** 函数名:     dynamic_sms_list_is_empty
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_sms_list_is_empty(void);
/*******************************************************************
** 函数名:     dynamic_sms_list_push
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_sms_list_push(DYNAMIC_SMS_DATA_T *sms);
/*******************************************************************
** 函数名:     dynamic_sms_list_add
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_sms_list_add(char*num,kal_uint16 len,char * data);
/*******************************************************************
** 函数名:     dynamic_sms_list_pop
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_sms_list_pop(void);
/*******************************************************************
** 函数名:     dynamic_sms_save
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_sms_save(void);
/*******************************************************************
** 函数名:     dynamic_sms_list_reset
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_sms_list_reset(void);
/*******************************************************************
** 函数名:     dynamic_sms_init
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
void dynamic_sms_init(void);


#endif

