
/********************************************************************************
**
** 文件名:     dynamic_common.h
** 版权所有:   
** 文件描述:   
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**|  |  | 
*********************************************************************************/
#ifndef __DYNAMIC_COMMON_H__
#define __DYNAMIC_COMMON_H__ 1

#include "dynamic_init.h"

#define BIT_VALUE_SET(v, b) ((v) |= (1U<<(b)))
#define BIT_VALUE_CLEAR(v, b) ((v) &= (~(1U<<(b))))
#define BIT_VALUE_GET(v, b) ((v) & (1U<<(b)))


/*******************************************************************
** 函数名:     dynamic_malloc_malloc
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
void*  dynamic_malloc_malloc (kal_uint32 size);
/*******************************************************************
** 函数名:     dynamic_big_endian_pack_short
** 函数描述:   按大端把数据流组成short
** 参数:       
** 返回:       
********************************************************************/
kal_int16 dynamic_big_endian_pack_short(kal_uint8*data);
/*******************************************************************
** 函数名:     dynamic_big_endian_pack_int
** 函数描述:   按大端把数据流组成int
** 参数:       
** 返回:       
********************************************************************/
kal_int32 dynamic_big_endian_pack_int(kal_uint8*data);
/*******************************************************************
** 函数名:     dynamic_big_endian_transm_short
** 函数描述:   把双字节按大端模式传输
** 参数:       
** 返回:       
********************************************************************/
kal_uint16 dynamic_big_endian_transm_short(kal_uint8* dtr,kal_uint16 data);
/*******************************************************************
** 函数名:     dynamic_checksum_xor
** 函数描述:   异或校验码 单字节
** 参数:       
** 返回:       
********************************************************************/
kal_uint8 dynamic_checksum_xor(kal_uint8 *Ptr,kal_int32 len);
/*******************************************************************
** 函数名:     dynamic_find_byte_pos
** 函数描述:   查找单个字节的位置
** 参数:       
** 返回:       
********************************************************************/
kal_uint8* dynamic_find_byte_pos(kal_uint8 *sptr,kal_uint8 data,kal_uint32 maxlen);


#endif
