/********************************************************************************
**
** 文件名:     dynamic_telephony.c
** 版权所有:   
** 文件描述: 
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**|  |  | 
*********************************************************************************/

#include "dynamic_init.h"



/*******************************************************************
** 函数名:    dynamic_telephony_call_cb
** 函数描述:  电话状态回调，只有来电时号码参数才有效
** 输入参数:  call_stat:通话状态 CALL_STATUS_E
              num:电话号码，只有来电时，号码才有效
** 输出参数:
** 返回:      
********************************************************************/
void dynamic_telephony_call_cb(CALL_STATUS_E call_stat,kal_uint8 *num)
{
    dynamic_debug("dynamic_telephony_call_cb:%d,%s",call_stat,num);
#ifdef __XY_SUPPORT__
    xy_telephony_state_cb(call_stat,num);
#endif
}

/*******************************************************************
** 函数名:     dynamic_telephony_init
** 函数描述:   
** 参数:       
** 返回:       
********************************************************************/
void dynamic_telephony_init(void)
{
    dynamic_sms_init();
    dynamic_telephony_call_cb_reg((CALL_CB)dynamic_telephony_call_cb);
    

}


